H3_OF10_base_Turbulent/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


mover
{
    type            motionSolver;

    libs            ("libfvMeshMovers.so" "libfvMotionSolvers.so");

    motionSolver    displacementLaplacian;
    
    displacementLaplacianCoeffs
    {
    	// diffusivity  uniform;
    	// diffusivity  directional (1 200 0);
    	// diffusivity  motionDirectional (1 1000 0);
    	// diffusivity  file motionDiffusivity;
	
    	diffusivity  inverseDistance 1 (floatingObj);
    }
    
}


// ************************************************************************* //
