H3_OF10_base_Turbulent/constant/waveProperties.input
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version	2.0;
    format	ascii;
    class	dictionary;
    object	waveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

timeShift           0;

seaLevel            0.0;

relaxationNames     ( inlet outlet );

initializationName  outlet;

pName               p_rgh;

inletCoeffs
{
    waveType            stokesFirst;
    Tsoft               2;
    depth               0.5;
    period              2.02;
    direction           ( 1 0 0 );
    phi                 0;
    height              0.02;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           INLET;
        startX              ( 0 0 0 );
        endX                ( 1 0 0.01 );
        orientation         ( 1 0 0 );
    }
}

outletCoeffs
{
    waveType            potentialCurrent;
    U                   ( 0 0 0 );
    Tsoft               2;

    relaxationZone
    {
        relaxationScheme    Spatial;
        relaxationShape     Rectangular;
        beachType           Empty;
        relaxType           OUTLET;
        startX              ( 28 0 0 );
        endX                ( 30 0 0.01 );
        orientation         ( 1 0 0 );
    }
}



// ************************************************************************* //
