H3_OF10_base_Turbulent/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    geometria.stl
    {
        type            uniformFixedValue;
        uniformValue    table
        
7501
(
(0 (0 0 0))
(0.01 (0 -0.000396 0))
(0.02 (0 -0.000792 0))
(0.03 (0 -0.001188 0))
(0.04 (0 -0.001583 0))
(0.05 (0 -0.001978 0))
(0.06 (0 -0.002373 0))
(0.07 (0 -0.002767 0))
(0.08 (0 -0.00316 0))
(0.09 (0 -0.003551 0))
(0.1 (0 -0.003942 0))
(0.11 (0 -0.004332 0))
(0.12 (0 -0.004721 0))
(0.13 (0 -0.005108 0))
(0.14 (0 -0.005493 0))
(0.15 (0 -0.005877 0))
(0.16 (0 -0.006259 0))
(0.17 (0 -0.00664 0))
(0.18 (0 -0.007018 0))
(0.19 (0 -0.007395 0))
(0.2 (0 -0.007769 0))
(0.21 (0 -0.00814 0))
(0.22 (0 -0.00851 0))
(0.23 (0 -0.008877 0))
(0.24 (0 -0.009241 0))
(0.25 (0 -0.009602 0))
(0.26 (0 -0.009961 0))
(0.27 (0 -0.010317 0))
(0.28 (0 -0.010669 0))
(0.29 (0 -0.011019 0))
(0.3 (0 -0.011365 0))
(0.31 (0 -0.011707 0))
(0.32 (0 -0.012046 0))
(0.33 (0 -0.012382 0))
(0.34 (0 -0.012714 0))
(0.35 (0 -0.013041 0))
(0.36 (0 -0.013365 0))
(0.37 (0 -0.013685 0))
(0.38 (0 -0.014001 0))
(0.39 (0 -0.014313 0))
(0.4 (0 -0.01462 0))
(0.41 (0 -0.014922 0))
(0.42 (0 -0.015221 0))
(0.43 (0 -0.015514 0))
(0.44 (0 -0.015803 0))
(0.45 (0 -0.016086 0))
(0.46 (0 -0.016365 0))
(0.47 (0 -0.016639 0))
(0.48 (0 -0.016908 0))
(0.49 (0 -0.017171 0))
(0.5 (0 -0.017429 0))
(0.51 (0 -0.017682 0))
(0.52 (0 -0.017929 0))
(0.53 (0 -0.01817 0))
(0.54 (0 -0.018406 0))
(0.55 (0 -0.018636 0))
(0.56 (0 -0.01886 0))
(0.57 (0 -0.019078 0))
(0.58 (0 -0.01929 0))
(0.59 (0 -0.019496 0))
(0.6 (0 -0.019696 0))
(0.61 (0 -0.019889 0))
(0.62 (0 -0.020076 0))
(0.63 (0 -0.020256 0))
(0.64 (0 -0.02043 0))
(0.65 (0 -0.020597 0))
(0.66 (0 -0.020757 0))
(0.67 (0 -0.020911 0))
(0.68 (0 -0.021058 0))
(0.69 (0 -0.021197 0))
(0.7 (0 -0.02133 0))
(0.71 (0 -0.021456 0))
(0.72 (0 -0.021574 0))
(0.73 (0 -0.021685 0))
(0.74 (0 -0.021789 0))
(0.75 (0 -0.021886 0))
(0.76 (0 -0.021975 0))
(0.77 (0 -0.022056 0))
(0.78 (0 -0.02213 0))
(0.79 (0 -0.022196 0))
(0.8 (0 -0.022255 0))
(0.81 (0 -0.022306 0))
(0.82 (0 -0.022348 0))
(0.83 (0 -0.022384 0))
(0.84 (0 -0.022411 0))
(0.85 (0 -0.02243 0))
(0.86 (0 -0.022441 0))
(0.87 (0 -0.022444 0))
(0.88 (0 -0.022439 0))
(0.89 (0 -0.022425 0))
(0.9 (0 -0.022403 0))
(0.91 (0 -0.022374 0))
(0.92 (0 -0.022335 0))
(0.93 (0 -0.022288 0))
(0.94 (0 -0.022233 0))
(0.95 (0 -0.02217 0))
(0.96 (0 -0.022098 0))
(0.97 (0 -0.022017 0))
...
)
;
    }
}


// ************************************************************************* //
