H3_OF10_base_Turbulent/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces
{
    type        forces;
    functionObjectLibs ( "libforces.so" );
    writeControl timeStep;
    writeInterval 1;
    libs            ("libforces.so");
    forcesCoeffs    (forces);

    patches     (floatingObj); // THE NAME OF THE OBJECT
    pName       p_rgh;
    UName       U;
    rhoName     rhoInf;   // Indicates incompressible
    log         true;
    rhoInf      998.2;     // 
    CofR        (0 0 0);  // Axle midpoint on ground

}


// ************************************************************************* //
